Revit 2027 API
ParameterTypeId.ProfileFamType Property
 "Profile"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ProfileFamType { get; }
Public Shared ReadOnly Property ProfileFamType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ProfileFamType {
	ForgeTypeId^ get ();
}
static member ProfileFamType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace